# -*- coding: utf-8 -*-
"""
Created on Sun Mar  7 23:45:26 2021

@author: 高长江
"""

def initTables() -> list:
    '''
    初始化四个字典

    Returns
    -------
    list
        长度为 4 的列表，每个元素是一个字典
        [0]: 通名
        [1]: 单元
        [2]: 音节
        [3]: 音标

    '''
    phonetics = {
    'common': {
    'none': {   'æ': "阿", 'ɑ': "阿", 'ʌ': "阿",
                'ɛ': "埃", 'eɪ': "埃",
                'ə': "厄",
                'i': "伊", 'ɪ': "伊",
                'ɔ': "奥", 'o': "奥", 'əʊ': "欧", 'oʊ': "欧",
                'u': "乌",
                'ju': "尤",
                'aɪ': "艾",
                'aʊ': "奥",
                'æn': "安", 'an': "安", 'ʌn': "安", 'æŋ': "安",
                'ɑn': "昂", 'ʌŋ': "昂", 'aʊn': "昂", 'ɔn': "昂", 'ɔŋ': "昂",
                'ən': "恩", 'əŋ': "恩", 'ɛn': "恩", 'ɛŋ': "恩",
                'ɪn': "因", 'in': "因", 'ɪən': "因", 'jən': "因",
                'ɪŋ':"英", 'iŋ': "英",
                'un': "温", 'oʊn': "温",
                'uŋ': "翁"},
    'b': { 'none': "布",
           'æ': "巴", 'ɑ': "巴", 'ʌ': "巴",
           'ɛ': "贝", 'eɪ': "贝",
           'ə': "伯",
           'i': "比", 'ɪ': "比", 'ji': "比", 'jɪ': "比",
           'ɔ': "博", 'o': "博", 'əʊ': "博", 'oʊ': "博",
           'u': "布",
           'ju': "比尤",
           'aɪ': "拜",
           'aʊ': "包",
           'æn': "班", 'an': "班", 'ʌn': "班", 'æŋ': "班",
           'ɑn': "邦", 'ʌŋ': "邦", 'aʊn': "邦", 'ɔn': "邦", 'ɔŋ': "邦",
           'ən': "本", 'əŋ': "本", 'ɛn': "本", 'ɛŋ': "本",
           'ɪn': "宾", 'in': "宾", 'ɪən': "宾", 'jən': "宾",
           'ɪŋ': "宾", 'iŋ': "宾",
           'un': "本", 'oʊn': "本",
           'uŋ': "邦"},
    'p': { 'none': "普",
           'æ': "帕", 'ɑ': "帕", 'ʌ': "帕",
           'ɛ': "佩", 'eɪ': "佩",
           'ə': "珀",
           'i': "皮", 'ɪ': "皮", 'ji': "皮", 'jɪ': "皮",
           'ɔ': "波", 'o': "波", 'əʊ': "波", 'oʊ': "波",
           'u': "普",
           'ju': "皮尤",
           'aɪ': "派",
           'aʊ': "保",
           'æn': "潘", 'an': "潘", 'ʌn': "潘", 'æŋ': "潘",
           'ɑn': "庞", 'ʌŋ': "庞", 'aʊn': "庞", 'ɔn': "庞", 'ɔŋ': "庞",
           'ən': "彭", 'əŋ': "彭", 'ɛn': "彭", 'ɛŋ': "彭",
           'ɪn': "平", 'in': "平", 'ɪən': "平", 'jən': "平",
           'ɪŋ': "平", 'iŋ': "平",
           'un': "蓬", 'oʊn': "蓬",
           'uŋ': "蓬"},
    'd': { 'none': "德",
           'æ': "达", 'ɑ': "达", 'ʌ': "达",
           'ɛ': "德/带", 'eɪ': "德/带",
           'ə': "德",
           'i': "迪", 'ɪ': "迪", 'ji': "迪", 'jɪ': "迪",
           'ɔ': "多", 'o': "多", 'əʊ': "多", 'oʊ': "多",
           'u': "杜",
           'ju': "迪尤",
           'aɪ': "代",
           'aʊ': "道",
           'æn': "丹", 'an': "丹", 'ʌn': "丹", 'æŋ': "丹",
           'ɑn': "当", 'ʌŋ': "当", 'aʊn': "当", 'ɔn': "当", 'ɔŋ': "当",
           'ən': "登", 'əŋ': "登", 'ɛn': "登", 'ɛŋ': "登",
           'ɪn': "丁", 'in': "丁", 'ɪən': "丁", 'jən': "丁",
           'ɪŋ': "丁", 'iŋ': "丁",
           'un': "敦", 'oʊn': "敦",
           'uŋ': "东/栋" },
    't': { 'none': "特",
           'æ': "塔", 'ɑ': "塔", 'ʌ': "塔",
           'ɛ': "特/泰", 'eɪ': "特/泰",
           'ə': "特",
           'i': "蒂", 'ɪ': "蒂", 'ji': "蒂", 'jɪ': "蒂",
           'ɔ': "托", 'o': "托", 'əʊ': "托", 'oʊ': "托",
           'u': "图",
           'ju': "蒂尤",
           'aɪ': "泰",
           'aʊ': "陶",
           'æn': "坦", 'an': "坦", 'ʌn': "坦", 'æŋ': "坦",
           'ɑn': "唐", 'ʌŋ': "唐", 'aʊn': "唐", 'ɔn': "唐", 'ɔŋ': "唐",
           'ən': "滕", 'əŋ': "滕", 'ɛn': "滕", 'ɛŋ': "滕",
           'ɪn': "廷", 'in': "廷", 'ɪən': "廷", 'jən': "廷",
           'ɪŋ': "廷", 'iŋ': "廷",
           'un': "通", 'oʊn': "通",
           'uŋ': "通"},
    'g': { 'none': "格",
           'æ': "加", 'ɑ': "加", 'ʌ': "加",
           'ɛ': "盖", 'eɪ': "盖",
           'ə': "格",
           'i': "吉", 'ɪ': "吉", 'ji': "吉", 'jɪ': "吉",
           'ɔ': "戈", 'o': "戈", 'əʊ': "戈", 'oʊ': "戈",
           'u': "古",
           'ju': "久",
           'aɪ': "盖",
           'aʊ': "高",
           'æn': "甘", 'an': "甘", 'ʌn': "甘", 'æŋ': "甘",
           'ɑn': "冈", 'ʌŋ': "冈", 'aʊn': "冈", 'ɔn': "冈", 'ɔŋ': "冈",
           'ən': "根", 'əŋ': "根", 'ɛn': "根", 'ɛŋ': "根",
           'ɪn': "金", 'in': "金", 'ɪən': "金", 'jən': "金",
           'ɪŋ': "京", 'iŋ': "京",
           'un': "贡", 'oʊn': "贡",
           'uŋ': "贡"},
    'k': { 'none': "克",
           'æ': "卡", 'ɑ': "卡", 'ʌ': "卡",
           'ɛ': "凯", 'eɪ': "凯",
           'ə': "克",
           'i': "基", 'ɪ': "基", 'ji': "基", 'jɪ': "基",
           'ɔ': "科", 'o': "科", 'əʊ': "科", 'oʊ': "科",
           'u': "库",
           'ju': "丘",
           'aɪ': "凯",
           'aʊ': "考",
           'æn': "坎", 'an': "坎", 'ʌn': "坎", 'æŋ': "坎",
           'ɑn': "康", 'ʌŋ': "康", 'aʊn': "康", 'ɔn': "康", 'ɔŋ': "康",
           'ən': "肯", 'əŋ': "肯", 'ɛn': "肯", 'ɛŋ': "肯",
           'ɪn': "金", 'in': "金", 'ɪən': "金", 'jən': "金",
           'ɪŋ': "金", 'iŋ': "金",
           'un': "昆", 'oʊn': "昆",
           'uŋ': "孔"},
    'v': { 'none': "弗/夫",
           'æ': "瓦", 'ɑ': "瓦", 'ʌ': "瓦",
           'ɛ': "韦", 'eɪ': "韦",
           'ə': "弗",
           'i': "维", 'ɪ': "维", 'ji': "维", 'jɪ': "维",
           'ɔ': "沃", 'o': "沃", 'əʊ': "沃", 'oʊ': "沃",
           'u': "武",
           'ju': "维尤",
           'aɪ': "韦",
           'aʊ': "沃",
           'æn': "万", 'an': "万", 'ʌn': "万", 'æŋ': "万",
           'ɑn': "旺", 'ʌŋ': "旺", 'aʊn': "旺", 'ɔn': "旺", 'ɔŋ': "旺",
           'ən': "文", 'əŋ': "文", 'ɛn': "文", 'ɛŋ': "文",
           'ɪn': "温", 'in': "温", 'ɪən': "温", 'jən': "温",
           'ɪŋ': "温", 'iŋ': "温",
           'un': "文", 'oʊn': "文",
           'uŋ': "翁"},
    'w': { 'none': "弗/夫",
           'æ': "瓦", 'ɑ': "瓦", 'ʌ': "瓦",
           'ɛ': "韦", 'eɪ': "韦",
           'ə': "沃",
           'i': "威", 'ɪ': "威", 'ji': "威", 'jɪ': "威",
           'ɔ': "沃", 'o': "沃", 'əʊ': "沃", 'oʊ': "沃",
           'u': "伍",
           'ju': "威尤",
           'aɪ': "怀",
           'aʊ': "沃",
           'æn': "万", 'an': "万", 'ʌn': "万", 'æŋ': "万",
           'ɑn': "旺", 'ʌŋ': "旺", 'aʊn': "旺", 'ɔn': "旺", 'ɔŋ': "旺",
           'ən': "文", 'əŋ': "文", 'ɛn': "文", 'ɛŋ': "文",
           'ɪn': "温", 'in': "温", 'ɪən': "温", 'jən': "温",
           'ɪŋ': "温", 'iŋ': "温",
           'un': "文", 'oʊn': "文",
           'uŋ': "翁"},
    'f': { 'none': "弗/夫",
           'æ': "法", 'ɑ': "法", 'ʌ': "法",
           'ɛ': "费", 'eɪ': "费",
           'ə': "弗",
           'i': "菲", 'ɪ': "菲", 'ji': "菲", 'jɪ': "菲",
           'ɔ': "福", 'o': "福", 'əʊ': "福", 'oʊ': "福",
           'u': "富",
           'ju': "菲尤",
           'aɪ': "法",
           'aʊ': "福",
           'æn': "凡", 'an': "凡", 'ʌn': "凡", 'æŋ': "凡",
           'ɑn': "方", 'ʌŋ': "方", 'aʊn': "方", 'ɔn': "方", 'ɔŋ': "方",
           'ən': "芬", 'əŋ': "芬", 'ɛn': "芬", 'ɛŋ': "芬",
           'ɪn': "芬", 'in': "芬", 'ɪən': "芬", 'jən': "芬",
           'ɪŋ': "芬", 'iŋ': "芬",
           'un': "丰", 'oʊn': "丰",
           'uŋ': "丰"},
    'z': { 'none': "兹",
               'æ': "扎", 'ɑ': "扎", 'ʌ': "扎",
               'ɛ': "泽", 'eɪ': "泽",
               'ə': "泽",
               'i': "齐", 'ɪ': "齐", 'ji': "齐", 'jɪ': "齐",
               'ɔ': "佐", 'o': "佐", 'əʊ': "佐", 'oʊ': "佐",
               'u': "祖",
               'ju': "久",
               'aɪ': "宰",
               'aʊ': "藻",
               'æn': "赞", 'an': "赞", 'ʌn': "赞", 'æŋ': "赞",
               'ɑn': "藏", 'ʌŋ': "藏", 'aʊn': "藏", 'ɔn': "藏", 'ɔŋ': "藏",
               'ən': "曾", 'əŋ': "曾", 'ɛn': "曾", 'ɛŋ': "曾",
               'ɪn': "津", 'in': "津", 'ɪən': "津", 'jən': "津",
               'ɪŋ': "京", 'iŋ': "京",
               'un': "尊", 'oʊn': "尊",
               'uŋ': "宗"},
    'dz': { 'none': "兹",
               'æ': "扎", 'ɑ': "扎", 'ʌ': "扎",
               'ɛ': "泽", 'eɪ': "泽",
               'ə': "泽",
               'i': "齐", 'ɪ': "齐", 'ji': "齐", 'jɪ': "齐",
               'ɔ': "佐", 'o': "佐", 'əʊ': "佐", 'oʊ': "佐",
               'u': "祖",
               'ju': "久",
               'aɪ': "宰",
               'aʊ': "藻",
               'æn': "赞", 'an': "赞", 'ʌn': "赞", 'æŋ': "赞",
               'ɑn': "藏", 'ʌŋ': "藏", 'aʊn': "藏", 'ɔn': "藏", 'ɔŋ': "藏",
               'ən': "曾", 'əŋ': "曾", 'ɛn': "曾", 'ɛŋ': "曾",
               'ɪn': "津", 'in': "津", 'ɪən': "津", 'jən': "津",
               'ɪŋ': "京", 'iŋ': "京",
               'un': "尊", 'oʊn': "尊",
               'uŋ': "宗"},
    'ts': { 'none': "茨",
            'æ': "察", 'ɑ': "察", 'ʌ': "察",
            'ɛ': "采", 'eɪ': "采",
            'ə': "策",
            'i': "齐", 'ɪ': "齐", 'ji': "齐", 'jɪ': "齐",
            'ɔ': "措", 'o': "措", 'əʊ': "措", 'oʊ': "措",
            'u': "楚",
            'ju': "丘",
            'aɪ': "蔡",
            'aʊ': "曹",
            'æn': "灿", 'an': "灿", 'ʌn': "灿", 'æŋ': "灿",
            'ɑn': "仓", 'ʌŋ': "仓", 'aʊn': "仓", 'ɔn': "仓", 'ɔŋ': "仓",
            'ən': "岑", 'əŋ': "岑", 'ɛn': "岑", 'ɛŋ': "岑",
            'ɪn': "钦", 'in': "钦", 'ɪən': "钦", 'jən': "钦",
            'ɪŋ': "青", 'iŋ': "青",
            'un': "聪", 'oʊn': "聪",
            'uŋ': "聪"},
    's': { 'none': "斯",
            'æ': "萨", 'ɑ': "萨", 'ʌ': "萨",
            'ɛ': "塞", 'eɪ': "塞",
            'ə': "瑟",
            'i': "西/锡", 'ɪ': "西/锡", 'ji': "西/锡", 'jɪ': "西/锡",
            'ɔ': "索", 'o': "索", 'əʊ': "索", 'oʊ': "索",
            'u': "苏",
            'ju': "休",
            'aɪ': "赛",
            'aʊ': "绍",
            'æn': "桑", 'an': "桑", 'ʌn': "桑", 'æŋ': "桑",
            'ɑn': "桑", 'ʌŋ': "桑", 'aʊn': "桑", 'ɔn': "桑", 'ɔŋ': "桑",
            'ən': "森", 'əŋ': "森", 'ɛn': "森", 'ɛŋ': "森",
            'ɪn': "辛", 'in': "辛", 'ɪən': "辛", 'jən': "辛",
            'ɪŋ': "辛", 'iŋ': "辛",
            'un': "孙", 'oʊn': "孙",
            'uŋ': "松"},
    'ð': { 'none': "斯",
            'æ': "萨", 'ɑ': "萨", 'ʌ': "萨",
            'ɛ': "塞", 'eɪ': "塞",
            'ə': "瑟",
            'i': "西/锡", 'ɪ': "西/锡", 'ji': "西/锡", 'jɪ': "西/锡",
            'ɔ': "索", 'o': "索", 'əʊ': "索", 'oʊ': "索",
            'u': "苏",
            'ju': "休",
            'aɪ': "赛",
            'aʊ': "绍",
            'æn': "桑", 'an': "桑", 'ʌn': "桑", 'æŋ': "桑",
            'ɑn': "桑", 'ʌŋ': "桑", 'aʊn': "桑", 'ɔn': "桑", 'ɔŋ': "桑",
            'ən': "森", 'əŋ': "森", 'ɛn': "森", 'ɛŋ': "森",
            'ɪn': "辛", 'in': "辛", 'ɪən': "辛", 'jən': "辛",
            'ɪŋ': "辛", 'iŋ': "辛",
            'un': "孙", 'oʊn': "孙",
            'uŋ': "松"},
    'θ': { 'none': "斯",
            'æ': "萨", 'ɑ': "萨", 'ʌ': "萨",
            'ɛ': "塞", 'eɪ': "塞",
            'ə': "瑟",
            'i': "西/锡", 'ɪ': "西/锡", 'ji': "西/锡", 'jɪ': "西/锡",
            'ɔ': "索", 'o': "索", 'əʊ': "索", 'oʊ': "索",
            'u': "苏",
            'ju': "休",
            'aɪ': "赛",
            'aʊ': "绍",
            'æn': "桑", 'an': "桑", 'ʌn': "桑", 'æŋ': "桑",
            'ɑn': "桑", 'ʌŋ': "桑", 'aʊn': "桑", 'ɔn': "桑", 'ɔŋ': "桑",
            'ən': "森", 'əŋ': "森", 'ɛn': "森", 'ɛŋ': "森",
            'ɪn': "辛", 'in': "辛", 'ɪən': "辛", 'jən': "辛",
            'ɪŋ': "辛", 'iŋ': "辛",
            'un': "孙", 'oʊn': "孙",
            'uŋ': "松"},
    'ʒ': { 'none': "日",
           'ə': "热",
           'ɔ': "若", 'o': "若", 'əʊ': "若", 'oʊ': "若",
           'u': "茹",
           'ən': "任", 'əŋ': "任", 'ɛn': "任", 'ɛŋ': "任"},
    'ʃ': { 'none': "什",
           'æ': "沙", 'ɑ': "沙", 'ʌ': "沙",
           'ɛ': "谢", 'eɪ': "谢",
           'ə': "舍",
           'i': "希", 'ɪ': "希", 'ji': "希", 'jɪ': "希",
           'ɔ': "肖", 'o': "肖", 'əʊ': "肖", 'oʊ': "肖",
           'u': "舒",
           'ju': "休",
           'aɪ': "夏",
           'aʊ': "绍",
           'æn': "尚", 'an': "尚", 'ʌn': "尚", 'æŋ': "尚",
           'ɑn': "尚", 'ʌŋ': "尚", 'aʊn': "尚", 'ɔn': "尚", 'ɔŋ': "尚",
           'ən': "申", 'əŋ': "申", 'ɛn': "申", 'ɛŋ': "申",
           'ɪn': "欣", 'in': "欣", 'ɪən': "欣", 'jən': "欣",
           'ɪŋ': "兴", 'iŋ': "兴",
           'un': "顺", 'oʊn': "顺",
           'uŋ': "雄"},
    'ʤ': { 'none': "季",
           'æ': "贾", 'ɑ': "贾", 'ʌ': "贾",
           'ɛ': "杰", 'eɪ': "杰",
           'ə': "哲",
           'i': "吉", 'ɪ': "吉", 'ji': "吉", 'jɪ': "吉",
           'ɔ': "乔", 'o': "乔", 'əʊ': "乔", 'oʊ': "乔",
           'u': "朱",
           'ju': "久",
           'aɪ': "贾",
           'aʊ': "焦",
           'æn': "詹", 'an': "詹", 'ʌn': "詹", 'æŋ': "詹",
           'ɑn': "章", 'ʌŋ': "章", 'aʊn': "章", 'ɔn': "章", 'ɔŋ': "章",
           'ən': "真", 'əŋ': "真", 'ɛn': "真", 'ɛŋ': "真",
           'ɪn': "金", 'in': "金", 'ɪən': "金", 'jən': "金",
           'ɪŋ': "京", 'iŋ': "京",
           'un': "准", 'oʊn': "准",
           'uŋ': "琼"},
    'ʧ': { 'none': "奇",
           'æ': "查", 'ɑ': "查", 'ʌ': "查",
           'ɛ': "切", 'eɪ': "切",
           'ə': "彻",
           'i': "奇", 'ɪ': "奇", 'ji': "奇", 'jɪ': "奇",
           'ɔ': "乔", 'o': "乔", 'əʊ': "乔", 'oʊ': "乔",
           'u': "楚",
           'ju': "丘",
           'aɪ': "柴",
           'aʊ': "乔",
           'æn': "钱", 'an': "钱", 'ʌn': "钱", 'æŋ': "钱",
           'ɑn': "昌", 'ʌŋ': "昌", 'aʊn': "昌", 'ɔn': "昌", 'ɔŋ': "昌",
           'ən': "琴", 'əŋ': "琴", 'ɛn': "琴", 'ɛŋ': "琴",
           'ɪn': "钦", 'in': "钦", 'ɪən': "钦", 'jən': "钦",
           'ɪŋ': "青", 'iŋ': "青",
           'un': "春", 'oʊn': "春",
           'uŋ': "琼"},
    'h': { 'none': "赫",
           'æ': "哈", 'ɑ': "哈", 'ʌ': "哈",
           'ɛ': "赫/黑", 'eɪ': "赫/黑",
           'ə': "赫",
           'i': "希", 'ɪ': "希", 'ji': "希", 'jɪ': "希",
           'ɔ': "霍", 'o': "霍", 'əʊ': "霍", 'oʊ': "霍",
           'u': "胡",
           'ju': "休",
           'aɪ': "海/亥",
           'aʊ': "豪",
           'æn': "汉", 'an': "汉", 'ʌn': "汉", 'æŋ': "汉",
           'ɑn': "杭", 'ʌŋ': "杭", 'aʊn': "杭", 'ɔn': "杭", 'ɔŋ': "杭",
           'ən': "亨", 'əŋ': "亨", 'ɛn': "亨", 'ɛŋ': "亨",
           'ɪn': "欣", 'in': "欣", 'ɪən': "欣", 'jən': "欣",
           'ɪŋ': "兴", 'iŋ': "兴",
           'un': "洪", 'oʊn': "洪",
           'uŋ': "洪"},
    'm': { 'none': "姆",
           'æ': "马", 'ɑ': "马", 'ʌ': "马",
           'ɛ': "梅", 'eɪ': "梅",
           'ə': "默",
           'i': "米", 'ɪ': "米", 'ji': "米", 'jɪ': "米",
           'ɔ': "莫", 'o': "莫", 'əʊ': "莫", 'oʊ': "莫",
           'u': "穆",
           'ju': "缪",
           'aɪ': "迈",
           'aʊ': "毛",
           'æn': "曼", 'an': "曼", 'ʌn': "曼", 'æŋ': "曼",
           'ɑn': "芒", 'ʌŋ': "芒", 'aʊn': "芒", 'ɔn': "芒", 'ɔŋ': "芒",
           'ən': "门", 'əŋ': "门", 'ɛn': "门", 'ɛŋ': "门",
           'ɪn': "明", 'in': "明", 'ɪən': "明", 'jən': "明",
           'ɪŋ': "明", 'iŋ': "明",
           'un': "蒙", 'oʊn': "蒙",
           'uŋ': "蒙"},
    'n': { 'none': "恩",
           'æ': "纳", 'ɑ': "纳", 'ʌ': "纳",
           'ɛ': "内", 'eɪ': "内",
           'ə': "纳",
           'i': "尼", 'ɪ': "尼", 'ji': "尼", 'jɪ': "尼",
           'ɔ': "诺", 'o': "诺", 'əʊ': "诺", 'oʊ': "诺",
           'u': "努",
           'ju': "纽",
           'aɪ': "奈",
           'aʊ': "瑙",
           'æn': "南/楠", 'an': "南/楠", 'ʌn': "南/楠", 'æŋ': "南/楠",
           'ɑn': "南/楠", 'ʌŋ': "南/楠", 'aʊn': "南/楠", 'ɔn': "南/楠", 'ɔŋ': "南/楠",
           'ən': "嫩", 'əŋ': "嫩", 'ɛn': "嫩", 'ɛŋ': "嫩",
           'ɪn': "宁", 'in': "宁", 'ɪən': "宁", 'jən': "宁",
           'ɪŋ': "宁", 'iŋ': "宁",
           'un': "嫩", 'oʊn': "嫩",
           'uŋ': "农"},
    'l': { 'none': "尔",
           'æ': "拉", 'ɑ': "拉", 'ʌ': "拉",
           'ɛ': "莱", 'eɪ': "莱",
           'ə': "勒",
           'i': "利", 'ɪ': "利", 'ji': "利", 'jɪ': "利",
           'ɔ': "洛", 'o': "洛", 'əʊ': "洛", 'oʊ': "洛",
           'u': "卢",
           'ju': "柳",
           'aɪ': "莱",
           'aʊ': "劳",
           'æn': "兰", 'an': "兰", 'ʌn': "兰", 'æŋ': "兰",
           'ɑn': "朗", 'ʌŋ': "朗", 'aʊn': "朗", 'ɔn': "朗", 'ɔŋ': "朗",
           'ən': "伦", 'əŋ': "伦", 'ɛn': "伦", 'ɛŋ': "伦",
           'ɪn': "林", 'in': "林", 'ɪən': "林", 'jən': "林",
           'ɪŋ': "灵", 'iŋ': "灵",
           'un': "伦", 'oʊn': "伦",
           'uŋ': "隆"},
    'r': { 'none': "尔",
           'æ': "拉", 'ɑ': "拉", 'ʌ': "拉",
           'ɛ': "雷", 'eɪ': "雷",
           'ə': "勒",
           'i': "里", 'ɪ': "里", 'ji': "里", 'jɪ': "里",
           'ɔ': "罗", 'o': "罗", 'əʊ': "罗", 'oʊ': "罗",
           'u': "鲁",
           'ju': "留",
           'aɪ': "赖",
           'aʊ': "劳",
           'æn': "兰", 'an': "兰", 'ʌn': "兰", 'æŋ': "兰",
           'ɑn': "朗", 'ʌŋ': "朗", 'aʊn': "朗", 'ɔn': "朗", 'ɔŋ': "朗",
           'ən': "伦", 'əŋ': "伦", 'ɛn': "伦", 'ɛŋ': "伦",
           'ɪn': "林", 'in': "林", 'ɪən': "林", 'jən': "林",
           'ɪŋ': "灵", 'iŋ': "灵",
           'un': "伦", 'oʊn': "伦",
           'uŋ': "龙"},
    'j': { 'none': "伊",
           'æ': "亚", 'ɑ': "亚", 'ʌ': "亚",
           'ɛ': "耶", 'eɪ': "耶",
           'ə': "耶",
           'i': "伊", 'ɪ': "伊", 'ji': "伊", 'jɪ': "伊",
           'ɔ': "约", 'o': "约", 'əʊ': "约", 'oʊ': "约",
           'u': "尤",
           'aɪ': "耶",
           'aʊ': "尧",
           'æn': "扬", 'an': "扬", 'ʌn': "扬", 'æŋ': "扬",
           'ɑn': "扬", 'ʌŋ': "扬", 'aʊn': "扬", 'ɔn': "扬", 'ɔŋ': "扬",
           'ən': "因", 'əŋ': "因", 'ɛn': "因", 'ɛŋ': "因",
           'ɪŋ': "英", 'iŋ': "英",
           'un': "云", 'oʊn': "云",
           'uŋ': "永"},
    'gw': {'æ': "瓜", 'ɑ': "瓜", 'ʌ': "瓜",
           'ɛ': "圭", 'eɪ': "圭",
           'ə': "果",
           'i': "圭", 'ɪ': "圭", 'ji': "圭", 'jɪ': "圭",
           'ɔ': "果", 'o': "果", 'əʊ': "果", 'oʊ': "果",
           'aɪ': "瓜伊",
           'æn': "关", 'an': "关", 'ʌn': "关", 'æŋ': "关",
           'ɑn': "光", 'ʌŋ': "光", 'aʊn': "光", 'ɔn': "光", 'ɔŋ': "光",
           'ən': "古恩", 'əŋ': "古恩", 'ɛn': "古恩", 'ɛŋ': "古恩",
           'ɪn': "古因", 'in': "古因", 'ɪən': "古因", 'jən': "古因",
           'ɪŋ': "古英", 'iŋ': "古英"},
    'kw': {'æ': "夸", 'ɑ': "夸", 'ʌ': "夸",
           'ɛ': "奎", 'eɪ': "奎",
           'ə': "阔",
           'i': "奎", 'ɪ': "奎", 'ji': "奎", 'jɪ': "奎",
           'ɔ': "阔", 'o': "阔", 'əʊ': "阔", 'oʊ': "阔",
           'u': "库",
           'aɪ': "夸",
           'aʊ': "阔",
           'æn': "宽", 'an': "宽", 'ʌn': "宽", 'æŋ': "宽",
           'ɑn': "匡", 'ʌŋ': "匡", 'aʊn': "匡", 'ɔn': "匡", 'ɔŋ': "匡",
           'ən': "昆", 'əŋ': "昆", 'ɛn': "昆", 'ɛŋ': "昆",
           'ɪn': "昆", 'in': "昆", 'ɪən': "昆", 'jən': "昆"},
    'hw': {'æ': "华", 'ɑ': "华", 'ʌ': "华",
           'ɛ': "惠", 'eɪ': "惠",
           'ə': "霍",
           'i': "惠", 'ɪ': "惠", 'ji': "惠", 'jɪ': "惠",
           'ɔ': "霍", 'o': "霍", 'əʊ': "霍", 'oʊ': "霍",
           'aɪ': "怀",
           'æn': "环", 'an': "环", 'ʌn': "环", 'æŋ': "环",
           'ɑn': "黄", 'ʌŋ': "黄", 'aʊn': "黄", 'ɔn': "黄", 'ɔŋ': "黄",
           'uŋ': "洪"}
              },
    'female': {
        'd': {'ɛ': "黛", 'eɪ': "黛", 'aɪ': "黛",},
        's': {'none': "丝",},
        'ð': {'none': "丝",},
        'θ': {'none': "丝",},
        'ʃ': {'æ': "莎", 'ɑ': "莎", 'ʌ': "莎",},
        'ʤ': {'ən': "珍", 'əŋ': "珍", 'ɛn': "珍", 'ɛŋ': "珍",},
        'm': {'æ': "玛", 'ɑ': "玛", 'ʌ': "玛",},
        'n': {'æ': "娜", 'ɑ': "娜", 'ʌ': "娜", 'ə': "娜",
              'i': "妮", 'ɪ': "妮", 'ji': "妮", 'jɪ': "妮",},
        'l': {'i': "莉", 'ɪ': "莉", 'ji': "莉", 'jɪ': "莉",
              'ɪn': "琳", 'in': "琳", 'ɪən': "琳", 'jən': "琳",},
        'r': {'i': "丽", 'ɪ': "丽", 'ji': "丽", 'jɪ': "丽",
              'ɪn': "琳", 'in': "琳", 'ɪən': "琳", 'jən': "琳",},
        'j': {'æ': "娅", 'ɑ': "娅", 'ʌ': "娅",}
    }
    }
    generics = {'abbey': "教堂", 'airfield': "机场", 'airport': "机场", 'anchorage': "锚地",
         'aqueduct': "沟/渠", 'archipelago': "群岛", 'arm': "湾/河/支流", 'atoll': "环礁",
         'bank': "浅滩", 'banks': "浅滩", 'bar': "沙洲", 'barrow': "山",
         'basin': "盆地/海盆", 'bay': "湾", 'bayou': "湖/长沼", 'beach': "滩",
         'beacon': "灯塔", 'bench': "阶地/海底阶地", 'big': "大", 'bight': "湾",
         'bill': "角/岬", 'bluff': "陡崖", 'bog': "沼泽", 'borough': "区/市",
         'bourn': "溪", 'bourne': "溪", 'branch': "支流", 'bridge': "桥",
         'broad': "湖沼", 'brook': "河", 'burrow': "洞穴", 'butte': "峰/山",
         'cairn': "岩/山", 'camp': "营", 'canal': "运河/渠", 'canyon': "峡谷/海底峡谷",
         'canyon delta': "深海三角洲", 'cape': "角", 'cascade': "瀑布", 'castle': "堡",
         'cataract': "瀑布", 'cave': "洞/溶洞", 'cay': "礁/岛", 'cemetery': "墓地",
         'center': "中", 'central': "中", 'channel': "水道/海峡/深海水道", 'church': "教堂",
         'city': "城/市", 'cliff': "陡崖", 'clough': "峡谷", 'coast': "海岸",
         'college': "学院", 'cone': "丘/深海锥", 'cordillera': "山脉/海底山脉", 'country': "县/郡",
         'cove': "湾", 'crag': "岩", 'crater': "火山口", 'creek': "溪/河",
         'dam': "坝", 'deep': "海渊", 'delta': "三角洲", 'department': "省/洲",
         'depression': "洼地/海洼", 'depth': "海渊", 'desert': "沙漠/荒漠", 'district': "区",
         'ditch': "沟/渠", 'divide': "分水岭", 'down': "丘", 'drain': "排水渠",
         'dry valley': "干谷", 'dune': "沙丘", 'dunes': "沙丘", 'dyke': "堤/沟",
         'east': "东", 'eastern': "东/东部", 'end': "角", 'entrance': "入口",
         'escarpment': "陡崖/海崖", 'estuary': "河口湾", 'fall': "瀑布", 'falls': "瀑布",
         'fan': "深海扇", 'farm': "农场", 'farms': "农场", 'fell': "丘/沼泽",
         'fen': "沼泽", 'ferry': "渡口", 'firth': "湾", 'flat': "沙滩/海底平滩",
         'flume': "峡谷", 'ford': "浅滩/渡口", 'foreland': "海角", 'forest': "森林/林地",
         'fork': "支流/河", 'fort': "堡", 'fracture zone': "破裂带/断裂带", 'gap': "山口/海岭裂口/海沟",
         'garden': "花园", 'glacier': "冰川", 'glade': "湿地/沼泽", 'glen': "河谷/谷地",
         'gorge': "峡谷", 'grand': "大", 'grass': "草场/牧地", 'grassland': "草场/牧地",
         'great': "大", 'greater': "大", 'green': "草地", 'gulf': "湾",
         'gully': "冲沟", 'guyot': "平顶海山", 'harbor': "港", 'harbour': "港",
         'head': "角/峰", 'headland': "角", 'heath': "荒地", 'height': "高地",
         'highland': "高地", 'hill': "山", 'hillock': "丘", 'hills': "丘陵",
         'hole': "洞/湾/海穴", 'hollow': "洼地", 'holm': "岛", 'hook': "沙嘴/河湾",
         'horn': "角/峰/支流", 'iceberg': "冰山", 'icefalls': "冰瀑", 'ice field': "冰原",
         'ice shelf': "冰架", 'ice tongue': "冰舌", 'Indian reservation': "印第安人保留地/印第安人居留地",
         'inlet': "湾", 'insular shelf': "岛架", 'island': "岛", 'islands': "群岛",
         'isle': "岛", 'isles': "群岛", 'islet': "岛", 'isthmus': "地峡",
         'key': "礁/岛", 'knob': "圆丘/山", 'knoll': "圆丘/海穹", 'knolls': "圆丘/海穹群",
         'knoll group': "海穹群", 'lagoon': "潟湖", 'lake': "湖", 'lakes': "湖群",
         'land': "地", 'ledge': "暗礁", 'levee': "深海堤", 'lighthouse': "灯塔",
         'little': "小", 'loch': "湖/湾", 'long': "长", 'low': "下",
         'lower': "下", 'lowland': "低地", 'manor': "庄园", 'mare': "海",
         'market': "市场", 'marsh': "沼泽", 'massif': "山", 'meadow': "草场/牧地",
         'middle': "中", 'moat': "海壕", 'monument': "纪念地", 'moor': "荒地/沼泽",
         'moss': "沼泽", 'mound': "丘", 'mount': "山/峰", 'mountain': "山",
         'mountains': "山/山脉", 'mouth': "河口", 'mull': "角", 'narrow': "海峡",
         'national park': "国家公园", 'neck': "岬/角", 'ness': "角/海角", 'new': "新",
         'north': "北", 'northern': "北/北部", 'nose': "角", 'oasis': "绿洲",
         'ocean': "洋", 'old': "旧", 'outer': "外", 'outfall': "河口",
         'parish': "教区", 'park': "公园", 'pass': "山口/水道/海山口", 'passage': "水道/海峡",
         'patc': "点礁", 'peak': "峰/海峰", 'peninsula': "半岛", 'piedmont': "山麓",
         'pier': "码头", 'pike': "山/峰", 'pikes': "山/峰", 'pinnacle': "峰/尖礁",
         'pit': "坑/盆地", 'plain': "平原/深海平原", 'plateau': "高原/深海高原", 'platform': "台地/海台",
         'point': "角", 'pond': "池", 'pool': "池", 'port': "港",
         'post': "站", 'prairie': "草原", 'promontory': "角", 'province': "省",
         'quarter': "区", 'quay': "码头", 'range': "岭", 'ranges': "岭/山脉",
         'rapid': "急流", 'rapids': "急流", 'ravine': "沟谷", 'reef': "礁",
         'reefs': "群礁", 'refuge': "保护区", 'region': "区/地区", 'reservation': "居留地/保留地",
         'reservior': "水库", 'ridge': "岭", 'riding': "区", 'rift': "裂谷",
         'rise': "丘/海隆", 'river': "河", 'road': "路", 'rock': "岩",
         'ruin': "遗迹/遗址", 'ruins': "遗迹/遗址", 'run': "河", 'saddle': "山口",
         'saint': "圣", 'saltmarsh': "盐沼", 'sandbank': "滩", 'sands': "沙滩",
         'scar': "岩", 'sea': "海", 'seamount': "海山", 'seamount group': "海山群",
         'seamount range': "海底山脉", 'seashore': "海岸/海滨", 'settlement': "村/定居点", 'shlef': "陆架",
         'shire': "郡", 'shoal': "浅滩", 'shoals': "浅滩", 'skerry': "礁",
         'slope': "坡/陆坡", 'slough': "沼泽/河湾", 'sound': "湾/海峡", 'south': "南",
         'southern': "南/南部", 'spit': "沙嘴", 'spring': "泉", 'spur': "山嘴/海山嘴",
         'square': "广场", 'stack': "岩", 'state': "州", 'station': "站",
         'step': "阶地", 'strait': "海峡/水道", 'strath': "谷/河谷", 'stream': "河/溪",
         'street': "街", 'suburb': "郊区", 'summit': "峰", 'swamp': "沼泽",
         'swell': "海隆", 'tableland': "台地", 'terrace': "阶地/海底阶地", 'territory': "地区",
         'threshold': "海槛", 'tongue': "海舌", 'top': "峰/山", 'tor': "山/岩",
         'tower': "塔/堡", 'town': "镇/城", 'trench': "海沟", 'trough': "海槽",
         'tunnel': "隧道", 'upland': "高地", 'upper': "上", 'vale': "谷",
         'valley': "谷", 'village': "村", 'volcano': "火山", 'ward': "区",
         'wash': "洼地/沼泽", 'water': "河/湾/海峡", 'waterfall': "瀑布", 'waterway': "水道",
         'well': "井", 'west': "西", 'western': "西/西部", 'wharf': "码头",
         'wold': "山地", 'wood': "林地"}
    syllables = {'prefix':
            {'bau': "鲍", 'baw': "鲍", 'bow': "鲍", 'bur': "伯", 'cau': "考",
          'caw': "考", 'cow': "考", 'cur': "柯", 'daw': "道", 'down': "唐",
          'dun': "邓", 'gau': "高", 'hun': "亨", 'kir': "柯", 'kirk': "柯克",
          'lang': "兰", 'lau': "劳", 'law': "劳", 'llan': "兰", 'long': "朗",},
          'suffix': 
            {'baum': "鲍姆", 'berg': "伯格", 'berger': "伯格", 'berry': "伯里", 'bert': "伯特",
          'bluff': "布拉夫", 'bone': "伯恩", 'borg': "堡", 'born': "本", 'borne': "本",
          'boro': "伯勒", 'borough': "伯勒", 'bourn': "本", 'bourne': "本", 'brandt': "布兰特",
          'bridge': "布里奇", 'bright': "布赖特", 'brook': "布鲁克", 'brooke': "布鲁克", 'brough': "伯勒",
          'burg': "堡", 'burger': "伯格", 'burgh': "堡", 'burn': "本", 'burne': "本",
          'burrough': "伯勒", 'burton': "伯顿", 'bury': "伯里", 'by': "比", 'caster': "克斯特",
          'cau': "考", 'caw': "考", 'cham': "彻姆", 'chapel': "查珀尔", 'chard': "查德",
          'chester': "切斯特", 'child': "柴尔德", 'church': "彻奇", 'cius': "修斯", 'comb': "科姆",
          'combe': "科姆", 'corner': "科纳", 'cough': "克夫", 'cour': "库尔", 'cow': "考",
          'croft': "克罗夫特", 'dale': "代尔", 'dall': "德尔", 'dam': "丹", 'deau': "多",
          'dell': "德尔", 'den': "登", 'deus': "迪厄斯", 'dge': "奇", 'dham': "德姆",
          'dius': "迪厄斯", 'don': "登", 'dorf': "多夫", 'dow': "道", 'down': "当",
          'downe': "当", 'ds': "兹", 'dz': "兹", 'feld': "费尔德", 'felt': "费尔特",
          'field': "菲尔德", 'ford': "福德", 'fort': "福特", 'forth': "福斯", 'fus': "弗斯",
          'gan': "根", 'gate': "盖特", 'ge': "奇", 'gham': "汉", 'grave': "格雷夫",
          'grove': "格罗夫", 'haus': "豪斯", 'hausen': "豪森", 'haven': "黑文", 'head': "黑德",
          'horn': "霍恩", 'house': "豪斯", 'hull': "赫尔", 'hurst': "赫斯特", 'kall': "科尔",
          'kamp': "坎普", 'key': "基", 'lain': "莱恩", 'land': "兰", 'lander': "兰德",
          'lau': "劳", 'law': "劳", 'lay': "利", 'ledge': "利奇", 'leigh': "利",
          'lein': "莱恩", 'ler': "勒", 'less': "利斯", 'lett': "利特", 'lette': "利特",
          'ley': "利", 'lock': "洛克", 'ly': "利", 'main': "梅恩", 'man': "曼",
          'mann': "曼", 'mayer': "迈耶", 'meier': "迈耶", 'men': "门", 'mer': "默",
          'mere': "米尔", 'meyer': "迈耶", 'mont': "蒙特", 'more': "莫尔", 'mount': "芒特",
          'mouth': "茅斯", 'nall': "纳尔", 'nan': "南", 'nel': "内尔", 'nen': "嫩",
          'ner': "纳", 'ness': "内斯", 'nette': "内特", 'ney': "尼", 'night': "奈特",
          'nius': "尼厄斯", 'non': "嫩", 'nutt': "纳特", 'paugh': "波", 'pert': "珀特",
          'plain': "普莱恩", 'pool': "浦", 'port': "波特", 'que': "克", 'quist': "奎斯特",
          'rain': "雷恩", 'ral': "勒尔", 'rand': "兰德", 'ridge': "里奇", 'rol': "勒尔",
          'sad': "赛德", 'sall': "索尔", 'say': "赛", 'schmidt': "施米特", 'sen': "森",
          'sett': "西特", 'sette': "塞特", 'sey': "西", 'shall': "歇尔", 'sham': "舍姆",
          'shaw': "肖", 'shell': "谢尔", 'ship': "希普", 'shire': "希尔", 'side': "赛德",
          'sion': "申", 'sius': "修斯", 'smith': "史密斯", 'son': "森", 'spring': "斯普林",
          'springs': "斯普林斯", 'stadt': "施塔特", 'stair': "斯泰尔", 'stan': "斯坦", 'stane': "斯坦",
          'stead': "斯特德", 'sted': "斯特德", 'stedt': "施泰特", 'stine': "斯坦", 'stone': "斯通",
          'stowe': "斯托", 'strong': "斯特朗", 'sure': "热", 'table': "泰布尔", 'tain': "廷",
          'tall': "托尔", 'tch': "奇", 'ten': "滕", 'teus': "蒂厄斯", 'tham': "瑟姆",
          'then': "森", 'thian': "西恩", 'thorn': "索恩", 'thorp': "索普", 'thorpe': "索普",
          'thur': "瑟", 'tian': "琴", 'tion': "申", 'tius': "修斯", 'ton': "顿",
          'tone': "通", 'tow': "托", 'town': "敦", 'ts': "茨", 'tz': "茨",
          'vale': "韦尔", 'ville': "维尔", 'vin': "文", 'waite': "韦特", 'wale': "韦尔",
          'wall': "沃尔", 'ward': "沃德", 'water': "沃特", 'way': "韦", 'weil': "韦尔",
          'well': "韦尔", 'wen': "温", 'white': "怀特", 'wick': "威克", 'will': "威尔",
          'win': "温", 'wirth': "沃斯", 'witz': "威茨", 'wood': "伍德", 'worth': "沃斯",
          'worthy': "沃西", 'wright': "赖特", 'xius': "修斯", 'yard': "亚德", 'yer': "耶",
          'zen': "曾", 'zer': "泽"}
           }
    units = dict()
    tables = []
    tables.append(generics)
    tables.append(units)
    tables.append(syllables)
    tables.append(phonetics)
    return tables


class Table():
    # Father class of tables
    def __init__(self, tableData):
        # tableData 是一个字典
        self.data = tableData
    
    def inTable(self, key: str) -> bool:
        '''
        Checkout whether a key (source) is in the table

        Parameters
        ----------
        key : str
            The source name/unit/syllable/phonetic

        Returns
        -------
        bool
            the key is or is not in the table

        '''
        return (key in self.data)
    
    def lookup(self, key: str) -> str:
        '''
        Lookup the value (translation) of given key (source)

        Parameters
        ----------
        key : str
            The source name/unit/syllable/phonetic
            其中 phonetic 需要重写
        Returns
        -------
        str
            translation

        '''
        return self.data[key]

class genericTable(Table):
    # 通名的英文-中文字典
    def __init__(self, tableData):
        # TODO: implement
        super(genericTable, self).__init__(tableData)

class unitTable(Table):
    # 专名单元的英文-中文字典（暂时不用）
    def __init__(self, tableData):
        # TODO: implement
        super(unitTable, self).__init__(tableData)
        
class syllableTable(Table):
    # 特殊音节（附录C）的英文-中文字典
    def __init__(self, tableData):
        # TODO: implement
        super(syllableTable, self).__init__(tableData)

class phoneticTable(Table):
    # 音标的英文-中文字典（就是那个大表格）
    def __init__(self, tableData):
        # TODO: implement
        super(phoneticTable, self).__init__(tableData)
    def inTable(self, key: tuple) -> bool:
        '''
        重写判断函数，原因：需要查询两重 key

        Parameters
        ----------
        key : tuple
            (leadning, following)

        Returns
        -------
        bool
            是否在表内

        '''
        leading = key[0]
        following  = key[1]
        if leading not in self.data['common']: # leading 查不到
            return False
        else:
            entry_leading = self.data['common'][leading]
            return (following in entry_leading)

    def lookup(self, key: tuple) -> str:
        '''
        重写查询函数

        Parameters
        ----------
        key : tuple
            (leadning, following)

        Returns
        -------
        str
            翻译

        '''
        leading = key[0]
        following = key[1]
        common = self.data['common'][leading][following]
        if leading in self.data['female'] and following in self.data['female'][leading]:
            female = self.data['female'][leading][following]
            return common + " " + female
        else:
            return common
































